{"creq-id":"129","major":"Theatre-Design & Technical Production","concentrations":{"Theatre-Design & Technical Production":{"1":"Demonstrate an understanding of basic design principles and procedures, and experience in a least one of the design disciplines.","2":"Understand the relationship between lighting, scenic, costume, props, and sound design and how these elements combine to achieve a unity of vision in production.","3":"Clearly present research, design concepts, and staging plans in both verbal and visual form.","4":"Demonstrate a working knowledge of the most common forms, materials, and approach used for each design discipline in live performance, film, industrial, and commercial applications.","5":"Understand the history of theatre, visual styles, and design styles, and be able to utilize them in their work.","6":"Depending on design\/technical orientation, be able to:\r\nA.\tplan a production by drafting a plan, generating a finished model or renderings, all of the necessary design or construction drafting, a budget, and a production schedule that will include an estimated budget.\r\nB.\tunderstand and have the ability from construction drawings and renderings, to both construct and\/or supervise work crews in the construction of design elements that are safe, correctly built and cost effective, meeting the expectations of the designer, the director, and the producer.\r\nC.\tunderstand and safely use stage machinery, flying scenery, moving scenery manually, with motors, or with hydraulics.\r\nD.\timplement basic scene painting tasks under supervision of painting in-charge person at professional scene shops.\r\nE.\tsupervise a crew in the hanging and execution of a light plot, understand the programming necessary for lighting control systems, and sustain a design in performance while maintaining a safe working environment.\r\nF.\tsafely and correctly use and maintain all tools and equipment appropriate to a discipline, maintain a safe building shop, and supervise its personnel.","7":"Execute design elements in a timely manner that is safe and satisfies the requirements of the director, the designer, the performers, and the producer.","8":"Demonstrate the discipline and sense of responsibility necessary when working in the production team in the “real world”.","9":"Enter a graduate studies program in a design field or entertainment technologies or enter the job market in a non-faculty position.","10":"","11":"","12":"","notes":""}}}