{"creq-id":"99","major":"Latin Education (7-12)","concentrations":{"Latin Education (7-12)":{"1":"Make content knowledge accessible to students.\r\nCandidates in Latin and Chinese can present information, concepts and ideas in written and oral communication in the target language. The level of oral language proficiency should be at the Intermediate High level based on the grouping of languages by the Foreign Service Institute (FSI). They know their audience and can adjust their lessons as needed.\r\n","2":"Create, implement and assess instructional and curricular goals.\r\nCandidates in French, German, Spanish, Russian, Chinese and Latin use the Standards for Foreign Language Learning in the 21st Century (SFLL) and their state standards to design learning tasks and inform their instructional decisions. They integrate interpersonal, interpretive and presentation modes of communication in instruction. They understand culture from an anthropological perspective and engage learners in exploring and comparing cultures in terms of their interrelated products, practices and persepcties (3P’s). The candidates integrate content from other subject ares in the school and provide opportunities to connect with target-language communities. \r\nCandidates in French, German, Spanish, Russian, Chinese and Latin can design and use ongoing authentic performance assessments using a variety of assessment models for all learners.","3":"Create and maintain a respectful and productive classroom learning environment\r\nCandidates in French, German, Chinese, Spanish, Russian and Latin can create a physical and emotional learning environment that is safe, engages all learners actively in learning tasks and that supports interaction among and between the students and the teacher.","4":"Integrate technology to enhance learning.\r\nCandidates in French, German, Spanish, Russian, Chinese and Latin integrate multimedia, videotexts, the Internet and other technology-based tools such as podcasts, social networks, digital media and cell phones.","5":"Deliver instruction that is considerate of student development, diversity, and special needs.\r\nCandidates in French, German, Spanish, Russian, Chinese and Latin can adjust instructional plans according to age appropriate practices, and adapt lessons for students with special needs and for a diversity of learners.","6":"","7":"","8":"","9":"","10":"","11":"","12":"","notes":""}}}